Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
#ifndef __RTL8721D_REG_H__
#define __RTL8721D_REG_H__

/*--------------------------Define -------------------------------------------*/

//-----------------------------------------------------
//
//  0x0000h ~ 0x00FFh   System Configuration
//
//-----------------------------------------------------
#if 0
#define REG_WL_CLK_CTRL             0x0002
#define REG_WL_MAC_EN               0x0004
#define REG_WL_PHY_EN               0x0006
#define REG_WL_RF_EN                0x0007
#define REG_WL_PMC_CTRL             0x0020
#define REG_WL_POFF_CTRL            0x0022
#define REG_WL_PIN_FUNC_CTRL0       0x0070
#define REG_WL_PIN_FUNC_CTRL1       0x0074
#define REG_WL_PMC_ISR              0x0084
#define REG_RPWM                    0x008d
#define REG_RPWM2                   0x008e
#define REG_8051FWDL                0x0090
#define REG_MCUTSTCFG               0x0094
#define REG_ROM_VERSION             0x0099
#define REG_SYS_CFG                 0x009a
#define REG_INIT_OFLD_CTRL          REG_DBG_BYTE_6

#else        //mask for no define, ben, 160308
#define REG_SYS_ISO_CTRL            0x0000
#define REG_WL_CLK_CTRL             0x0002
#define REG_WL_FUNC_EN              0x0004
#define REG_WL_PHY_EN               0x0006
#define REG_RF_CTRL                 0x0007
#define REG_CLKDIV                  0x0008
//#define REG_9346CR                  0x000A
//#define REG_EE_VPD                  0x000C
//#define REG_AFE_MISC                0x0010
//#define REG_SPS0_CTRL               0x0011
//#define REG_SPS1_CTRL               0x0018
#define REG_RSV_CTRL                0x001C
//#define REG_RF_CTRL                 0x001F
#define REG_WL_PMC_CTRL             0x0020 
//#define REG_LDOV12D_CTRL            0x0021
//#define REG_LDOHCI12_CTRL           0x0022 
//#define REG_LPLDO_CTRL              0x0023
#define REG_WL_SYSCONFIG            0x0024
//#define REG_AFE_PLL_CTRL            0x0028
//#define REG_APE_PLL_CTRL_EXT        0x002C
#define REG_AFC_CTRL0               0x0030
#define REG_AFE_CTRL1_V1              0x0034					

//#define REG_PWR_DATA                0x0038
//#define REG_CAL_TIMER               0x003C
//#define REG_ACLK_MON                0x003E

//#define REG_GPIO_MUXCFG             0x0040
//#define REG_GPIO_PIN_CTRL           0x0044
//#define REG_GPIO_INTM               0x0048
//#define REG_LEDCFG                  0x004C

//FSIMR
//#define REG_SYSIMR0                 0x0050
//#define REG_SYSIMR1                 0x0051
//#define REG_SYSIMR2                 0x0052
//#define REG_SYSIMR3                 0x0053

//FSISR
//#define REG_SYSISR0                 0x0054
//#define REG_SYSISR1                 0x0055
//#define REG_SYSISR2                 0x0056
//#define REG_SYSISR3                 0x0057


//#define REG_GPIO_EXT_CTRL           0x0060
//#define REG_PAD_CTRL1               0x0064
//#define REG_WL_BT_PWR_CTRL          0x0068
//#define REG_GSSR                    0x006C
#define REG_WL_PIN_FUNC_CTRL0       0x0070
#define REG_WL_PIN_FUNC_CTRL1       0x0074
//#define REG_AFE_XTAL_CTRL_EXT       0x0078
//#define REG_XCK_OUTPUT_CTRL         0x007C    //8188E
#define REG_8051FWDL                0x0080




//0x0088 ~ 0x008F: there are no control circuit. But these register can be R/W.
//**Note**: 
//      If one of these register is used, we should register MACRO at RTLXXX_debug.h.

#define REG_INIT_OFLD_CTRL          REG_DBG_BYTE_6

#define REG_WL_LPS_CTRL             0x0090
#define REG_WL_POFF_CTRL            0x0091

#define REG_BOOT_REASON             0x0098
#define REG_RPWM                    0x009C
#define REG_RPWM2                   0x009E
#define REG_SYSON_FSM_MON           0x00A4
#define REG_PMC_DBG_CTL1            0x00A8
#define REG_PMC_DBG_CTL2            0x00AC


//#define REG_EFUSE_DATA0             0x00CC
//#define REG_EFUSE_DATA1             0x00CD
//#define REG_DBG_EN                  0x00CE    //8188E
//#define REG_EPPR                    0x00CF
//#define REG_BIST_SCAN               0x00D0
//#define REG_BIST_RPT                0x00D4
#define REG_BIST_ROM_RPT            0x00D8
#define REG_MEM_CTRL0               0x00E0
#define REG_MEM_CTRL1               0x00E4
#define REG_SDM_IDR_CTRL0           0x00E8
#define REG_SDM_IDR_CTRL1           0x00EC
#define REG_SYS_CFG                 0x00F0
//#define REG_SYS_STATUS_RPT          0x00F4
//#define REG_QINFV                   0x00F8    //8188E
#define REG_SYS_CFG3                0x00FC
#define REG_ROM_VERSION             0x0099
//#define REG_USB_CFG                 0x00FF
#endif

//-----------------------------------------------------
//
//  0x0100h ~ 0x01FFh   MACTOP General Configuration
//
//-----------------------------------------------------
#define REG_FUNC_ENABLE             0x0100
//#define REG_PAGE_SIZE               0x0104    //8812 doesn't use this register to set trx pagesize!!
#define REG_PKT_BUFF_ACCESS_CTRL    0x0106
#define REG_PLAYFORM_CLOCK          0x0109
#define REG_TRX_DMA_CTRL            0x010C
#define REG_SMPS_ENABLE             0x0110
#define REG_TX_PGBNDY               0x0114
#define REG_RX_PGBNDY               0x0116
#define REG_PKTFF_STATUS            0x0118
#define REG_RXFF_PTR                0x011C
#define REG_CPWM                    0x012F

//FWEIMR
#define REG_WLANIMR20                0x0120
#define REG_WLANIMR21                0x0121
#define REG_WLANIMR22                0x0122
#define REG_WLANIMR23                0x0123

//FWEISR
#define REG_WLANISR20                0x0124
#define REG_WLANISR21                0x0125
#define REG_WLANISR22                0x0126
#define REG_WLANISR23                0x0127

//FTEIMR
#define REG_FTIMR20                  0x0128
#define REG_FTIMR21                  0x0129
#define REG_FTIMR22                  0x012A
#define REG_FTIMR23                  0x012B

//FTEISR
#define REG_FTISR20                  0x012C
#define REG_FTISR21                  0x012D
#define REG_FTISR22                  0x012E
#define REG_FTISR23                  0x012F


//FWIMR
#define REG_WLANIMR0                0x0130
#define REG_WLANIMR1                0x0131
#define REG_WLANIMR2                0x0132
#define REG_WLANIMR3                0x0133

//FWISR
#define REG_WLANISR0                0x0134
#define REG_WLANISR1                0x0135
#define REG_WLANISR2                0x0136
#define REG_WLANISR3                0x0137

//FTIMR
#define REG_FTIMR0                  0x0138
#define REG_FTIMR1                  0x0139
#define REG_FTIMR2                  0x013A
#define REG_FTIMR3                  0x013B

