Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
//FTISR
#define REG_FTISR0                  0x013C
#define REG_FTISR1                  0x013D
#define REG_FTISR2                  0x013E
#define REG_FTISR3                  0x013F

#define REG_PKTBUF_DBG_CTRL         0x0140
#define REG_PKTBUF_DBG_DATA_L       0x0144
#define REG_PKTBUF_DBG_DATA_H       0x0148
#define REG_CPWM2                   0x014C

//
//  General Purpose Timer (Offset: 0x0150 - 0x016Fh)
//
#define REG_TC0_CTRL                0x0150  //by BT Time Division // instead of PowerTranning
#define REG_TC1_CTRL                0x0154  //by PS or APOffload(AP mode)
#define REG_TC2_CTRL                0x0158  //by PS
#define REG_TC3_CTRL                0x015C  //by PS
#define REG_TC4_CTRL                0x0160  //by Selective Suspend ROF
#define REG_TCUNIT                  0x0164
#define REG_TC5_CTRL                0x0168  //
#define REG_TC6_CTRL                0x016C  //BT TDMA

//#define REG_MREG_HCIDBG             0x0168    //8188E
//#define REG_MREG_CPUDBG             0x016C    //8188E
//0x168 ~ 0x16F: there are no control circuit. But these register can be R/W.
//**Note**: 
//      1.If one of these register is used, we should register MACRO at RTLXXX_debug.h.
//      2.8723BA uses this register as GTimer!!

#define REG_DRF_MBIST_FAIL          0x0170
#define REG_MBIST_START             0x0174
#define REG_MBIST_DONE              0x0178
#define REG_MBIST_FAIL              0x017C
#define REG_AES_DECRPT_DATA         0x0180
#define REG_AES_DECRPT_CFG          0x0184
#define REG_SHA1_DATA               0x0188
#define REG_SHA1_CFG                0x018C

//32K control reg
#define REG_TMCR                    0x0190
#define REG_32KCTRL1                0x0194
#define REG_32KCTRL2                0x0198
#define REG_32KCTRL3                0x019C

//0x1A0 ~ 0x1AF are used for C2H
#define REG_C2H_HEADER              0x01A0
#define REG_C2H_LEN                 0x01AE
#define REG_C2H_TRIGGER             0x01AF

#define REG_HIOE_CTRL               0x01B0
//#define REG_EFUSE_HW_CTRL              0x01B4

//0x1B8 ~ 0x1BF: there are no control circuit. But these register can be R/W.
//**Note**: 
//      If one of these register is used, we should register MACRO at RTLXXX_debug.h.


//0x1C0 ~ 0x1C7: there are no control circuit. But these register can be R/W.
//**Note**: 
//      If one of these register is used, we should register MACRO at RTLXXX_debug.h.

#define REG_FMETHR                  0x01C8
#define REG_HOST_MESSAGE_INT        0x01CC
#define REG_HOST_RCV_MESSAGE        0x01CF


//0x1D0 ~0x1DF are H2C message box
#define REG_H2C_0                   0x01d0
#define REG_H2C_1                   0x01d4
#define REG_H2C_2                   0x01d8
#define REG_H2C_3                   0x01dc

//LLT
#define REG_LLT_INIT_HDATA          0x01E0
#define REG_LLT_INIT_ADDR           0x01E1
#define REG_LLT_INIT_PDATA          0x01E2
#define REG_LLTE_RWM                0x01E3

//RAM Info
#define REG_RAM_VERSION             0x01E4
#define REG_RAM_SUBVERSION          0x01E5

//BB Indirect Access
#define REG_BB_PHY_CTRL             0x01E8
#define REG_BB_PHY_DATA             0x01EC

//0x1F0~0x1FF are used for H2C extension
#define REG_H2CEXT_0                0x01F0
#define REG_H2CEXT_1                0x01F4
#define REG_H2CEXT_2                0x01F8
#define REG_H2CEXT_3                0x01FC

//-----------------------------------------------------
//
//  0x0200h ~ 0x027Fh   TXDMA Configuration
//
//-----------------------------------------------------
#define REG_RQPN                    0x0200
#define REG_FIFOPAGE                0x0204
#define REG_TDECTL                  0x0208
#define REG_BCN_HEAD                0x0209
#define REG_TXDMA_OFFSET_CHECK      0x020C
#define REG_TXDMA_STATUS            0x0210
#define REG_RQPN_NPQ                0x0214
//#define REG_TXDMA_DBG               0x0218    //8188E
#define REG_AUTO_LLT                0x224

#define REG_H2C_HEAD			    0x0244
#define REG_H2C_TAIL				0x0248
#define REG_H2C_READ_ADDR			0x024C
#define REG_H2C_WR_ADDR				0x0250
#define REG_H2C_INFO				0x0254




//-----------------------------------------------------
//
//  0x0280h ~ 0x02FFh   RXDMA Configuration
//
//-----------------------------------------------------
#define REG_RXDMA_AGG_PG_TH         0x0280
#define REG_WOW_RXPKT_NUM           0x0282
#define REG_RXPKT_NUM               0x0284
#define REG_RXDMA_STATUS            0x0288
#define REG_RXDMA_DBG               0x028C
#define REG_RXDMA_PRO               0x0290
#define REG_C2HPKT                  0x0294

//-----------------------------------------------------
//
// BT_COEX
//
//-----------------------------------------------------
#define REG_BT_COEX_GLB_CTRL        0x02C0
#define REG_BT_COEX_TBL             0x02C4
#define REG_BT_SSI                  0x02D4
#define REG_BT_CSR_ENH_INTF_CTRL    0x02D6
#define REG_BT_ACT_STATISTICS       0x02D8
#define REG_BT_CMD_WLAN_RPT         0x02E0
#define REG_BT_CMD_BT_RPT           0x02E1
#define REG_BT_CMD_LATCH            0x02E2

//0x02F0~ 0x02FF: there are no control circuit. But these register can be R/W.
//**Note**: 
//      If one of these register is used, we should register MACRO at RTLXXX_debug.h.


//-----------------------------------------------------
//
//  0x0300h ~ 0x03FFh   PCIe
//
//-----------------------------------------------------
#define REG_DBI_WDATA               0x0348
#define REG_DBI_RDATA               0x034C
#define REG_DBI_CTRL                0x0350
#define REG_DBI_RWCMD               0x0352

#define REG_MDIO_WDATA              0x0354
#define REG_MDIO_RDATA              0x0356
#define REG_MDIO_CTRL               0x0358


#define REG_HRPWM                   0x0361
#define REG_HCPWM                   0x0363

//-----------------------------------------------------
//
//  0x0400h ~ 0x047Fh   Protocol Configuration
//
//-----------------------------------------------------
#define REG_Q0_INFORMATION          0x0400
#define REG_Q1_INFORMATION          0x0404
#define REG_Q2_INFORMATION          0x0408
#define REG_Q3_INFORMATION          0x040C
#define REG_MGQ_INFORMATION         0x0410
#define REG_HGQ_INFORMATION         0x0414
#define REG_BCNQ_INFORMATION        0x0418
#define REG_TX_ACQ_EMPTY            0x041A
#define REG_TX_MGQ_EMPTY            0x041B
#define REG_CPU_MGQ_INFORMATION     0x041C
#define REG_FUNCTION_ENABLE         0x0420
#define REG_HWSEQ_CTRL              0x0423
#define REG_TXPKTBUF_BCNQ_BDNY      0x0424
#define REG_TXPKTBUF_MGQ_BDNY       0x0425
#define REG_LIFETIME_CTRL           0x0426
#define REG_FREE_TAIL               0x0427
#define REG_SPEC0_SIFS              0x0428
#define REG_RL                      0x042A
#define REG_TXBF_CTRL           0x042C
#define REG_DARFRC                  0x0430
#define REG_RARFRC                  0x0438
#define REG_RRSR                    0x0440
#define REG_ARFR0                   0x0444
#define REG_ARFR1                   0x044C
#define REG_CCK_CHECK               0x0454
#define REG_AMPDU_MAX_TIME          0x0456
#define REG_TXPKTBUF_BCNQ_BDNY1     0x0457
#define REG_AMPDU_MAX_LENGTH        0x0458
#define REG_ACQ_STOP                0x045C
#define REG_WMAC_LBK_BUF_HD         0x045D
#define REG_TX_HANG_CTRL            0x045E
#define REG_FAST_EDCA_CTRL      0x0460
#define REG_RD_RESP_PKT_TH      0x0463
#define REG_Q4_INFORMATION          0x0468
#define REG_Q5_INFORMATION          0x046C
#define REG_Q6_INFORMATION          0x0470
#define REG_Q7_INFORMATION          0x0474
#define REG_SPCRPT_CTRL             0x047C
#define REG_SPC_W_PTR               0x047E
#define REG_SPC_R_PTR               0x047F
#define REG_INI_BASIC_CFEND_SEL     0x0481
#define REG_INI_STBC_CFEND_SEL      0x0482
#define REG_DATA_SC                 0x0483
#define REG_MACID_PKT_SLEEP_3       0x0484
#define REG_MACID_PKT_SLEEP_1       0x0488
#define REG_ARFR2                   0x048C
#define REG_ARFR3                   0x0494
//#define REG_ARFR4                   0x049C	// use by FW debug
#define REG_ARFR5                   0x04A4
#define REG_TXRPT_Start_Offset      0x04AC
#define REG_TRYING_CNT_TH           0x04B0
#define REG_POWER_STAGE1            0x04B4
#define REG_POWER_STAGE2            0x04B8
#define REG_SW_AMPDU_BURST_MODE     0x04BC
#define REG_PKT_LIFE_TIME           0x04C0
#define REG_STBC_SETTING            0x04C4
#define REG_QUEUE_CTRL              0x04C6
#define REG_PROT_MODE_CTRL          0x04C8
#define REG_BAR_MODE_CTRL           0x04CC
#define REG_RA_TRY_RATE_AGG_LMT     0x04CF
#define REG_MACID_PKT_SLEEP_2       0x04D0
#define REG_MACID_PKT_SLEEP_0       0x04D4
#define REG_HW_SEQ0                 0x04D8
#define REG_HW_SEQ1                 0x04DA
#define REG_HW_SEQ2                 0x04DC
#define REG_HW_SEQ3                 0x04DE
#define REG_NEED_CPU_HANDLE         0x04E0
#define REG_PTCL_ERR_STATUS         0x04E2
#define REG_TX_PKT_NUM              0x04E3
#define REG_PAGE4_DUMMY             0x04FC

//-----------------------------------------------------
//
//  0x0500h ~ 0x05FFh   EDCA Configuration
//
//-----------------------------------------------------
#define REG_EDCA_VO_PARAM           0x0500
#define REG_EDCA_VI_PARAM           0x0504
#define REG_EDCA_BE_PARAM           0x0508
#define REG_EDCA_BK_PARAM           0x050C
#define REG_BCNTCFG                 0x0510
#define REG_PIFS                    0x0512
#define REG_RDG_PIFS                0x0513
#define REG_SIFS                    0x0514
#define REG_TSFTR_SYN_OFFSET        0x0518
#define REG_AGGR_BREAK_TIME         0x051A
#define REG_SLOT                    0x051B
#define REG_TX_PTCL_CTRL            0x0520
#define REG_TXPAUSE                 0x0522
#define REG_DIS_TXREQ_CLR           0x0523
#define REG_RD_CTRL                 0x0524
#define REG_TX_PTCL_CTRL1           0x0525
#define REG_MBSSID_CTRL             0x0526
#define REG_P2PPS_CTRL              0x0527
#define REG_PKT_LIFETIME_CTRL       0x0528
#define REG_P2PPS_SPEC_STATE        0x052B
#define REG_TBTT_PROHIBIT           0x0540
#define REG_P2PPS_STATE             0x0543  
#define REG_RDG_RD_NAV_NXT          0x0544
#define REG_NAV_PROT_LEN            0x0546
#define REG_BCN_CTRL                0x0550
#define REG_BCN_CTRL1               0x0551
#define REG_MBID_NUM                0x0552
#define REG_DUAL_TSF_RST            0x0553
#define REG_MBSSID_BCN_SPACE        0x0554
#define REG_DRVERLYINT              0x0558
#define REG_BCNDMATIM               0x0559
#define REG_ATIMWND                 0x055A
#define REG_USTIME_TSF              0x055C
#define REG_BCN_MAX_ERR             0x055D
#define REG_RXTSF_OFFSET_CCK        0x055E
#define REG_RXTSF_OFFSET_OFDM       0x055F

#define REG_TSFTR                   0x0560
#define REG_TSFTR1                  0x0568
#define REG_ATIMWND1                0x0570
#define REG_CTWND                   0x0572
#define REG_BCNIVLCUNT              0x0573
#define REG_BCNDROPCTRL             0x0574
#define REG_HGQ_TIMEOUT_PERIOD      0x0575
#define REG_TSFTR2                  0x578

#define REG_PS_TIMER                0x0580
#define REG_PS_TIMER0               0x0584
#define REG_PS_TIMER1               0x0588
#define REG_TBTT_CTN_AREA           0x058C
#define REG_FORCE_BCN_IFS           0x058E
//#define REG_PRE_TX_CTRL             0x0590    //8188E
//#define REG_TXOP_CTRL               0x0592    //8188E
#define REG_ACMHWCTRL               0x05C0
#define REG_ACMRSTCTRL              0x05C1
#define REG_ACMAVG                  0x05C2
#define REG_VO_ADMTIME              0x05C4
#define REG_VI_ADMTIME              0x05C6
#define REG_BE_ADMTIME              0x05C8
#define REG_EDCA_RANDOM_GEN         0x05CC
#define REG_TXCMD_SEL               0x05CF
//#define REG_NOA_PARAM               0x05E0
#define REG_NOA_DURATION            0x05E0
#define REG_NOA_INTERVAL            0x05E4
#define REG_NOA_START_TIME          0x05E8
#define REG_NOA_COUNT               0x05EC
#define REG_TSF_SYNC               0x05F0
#define REG_SCH_TXCMD               0x05F8
#define REG_PAGE5_DUMMY             0x05FC

//-----------------------------------------------------
//
//  0x0600h ~ 0x07FFh   WMAC Configuration
//
//-----------------------------------------------------
#define REG_WMAC_CR                 0x0600
#define REG_TCR                     0x0604
#define REG_RCR                     0x0608
#define REG_RX_PKT_LIMIT            0x060C
#define REG_RX_DLK_TIME             0x060D
#define REG_RX_DRVINFO_SZ       0x060F
#define REG_MACID                   0x0610
#define REG_BSSID                   0x0618
#define REG_MAR                     0x0620
#define REG_MBIDCAMCFG              0x0628

//0x630 ~ 0x637: there are no control circuit. But these register can be R/W.
//**Note**: 
//      If one of these register is used, we should register MACRO at RTLXXX_debug.h.
#define REG_AOAC_REASON             0x0630
#define REG_AOAC_DEBUG              0x0634


#define REG_USTIME_EDCA             0x0638
#define REG_MAC_SPEC_SIFS           0x063A
#define REG_RESP_SIFS_CCK       0x063C
#define REG_RESP_SIFS_OFDM      0x063E
#define REG_ACKTO                   0x0640
#define REG_CTS2TO                  0x0641
#define REG_EIFS                    0x0642

//WMA, BA, CCX
#define REG_NAV_CTRL                0x0650
#define REG_BACAMCMD                0x0654
#define REG_BACAMCONTENT            0x0658
#define REG_LBDLY                   0x0660
#define REG_RTR                     0x0662
#define REG_RXERR_RPT               0x0664
#define REG_WMAC_TRXPTCL_CTL        0x0668

// Security
#define REG_CAMCMD                  0x0670
#define REG_CAMWRITE                0x0674
#define REG_CAMREAD                 0x0678
#define REG_CAMDBG                  0x067C
#define REG_SECCFG                  0x0680

// Power
#define REG_WOW_CTRL                0x0690
#define REG_PS_RX_INFO              0x0692
#define REG_WMMPS_UAPSD_TID         0x0693
#define REG_WKFMCAM_NUM             0x0698
#define REG_RXFLTMAP0               0x06A0
#define REG_RXFLTMAP1               0x06A2
#define REG_RXFLTMAP2               0x06A4
#define REG_BCN_PSR_RPT             0x06A8
#define REG_CALB32K_CTRL            0x06AC //spec no description, check RTL!!
#define REG_PKT_MON_CTRL            0x06B4
#define REG_COEX_TABLE1             0x06C0
#define REG_COEX_TABLE2             0x06C4
#define REG_BREAK_TABLE1            0x06C8
#define REG_BREAK_TABLE2            0x06CA
#define REG_ANT_SEL                 0x06CC

#define REG_RX_CSI_RPT_INFO         0x071C
#define REG_BT_COEX                 0x0764
#define REG_WLAN_ACT_MSK_CTRL       0x0768
#define REG_REG_BT_STATISTICS_CTRL  0x076E
#define REG_BT_ACT_STATISTICS_RPT   0x0770
#define REG_BT_STATISTICS_OTH_CTRL  0x0778
#define REG_BT_ISR_CTRL             0x0783
#define REG_BT_ISR_STA              0x078F
#define REG_PLCP_HDR                0x0740

#define REG_WL2LTECOEX_Indirect_Access_CTRL	0x7C0
#define REG_WL2LTECOEX_Indirect_Access_WRITE_DATA	0x7C4
#define REG_WL2LTECOEX_Indirect_Access_READ_DATA	0x7C8

//NAN related
#define     REG_NAN_DISC_BCNQ_BDNY      0x0457
#define     REG_NAN_SYNC_BCNQ_BDNY      0x0455
#define     REG_NAN_CAMR_HOP_CNT        0x05DC
#define     REG_NAN_ROLE                0x5DF
#define     REG_FA_FILTER1              0x7D4
#define     REG_FA_FILTER2              0x7D8
#define     REG_NAN_FUNC_CTRL            0x7DC
#define     REG_NAN_ATTRI_ID_VLD        0x7DD
#define     REG_NAN_ATTRI_ID0               0x7DE
#define     REG_NAN_ATTRI_ID1               0x7DF
#define     REG_NAN_ATTRI_ID2               0x7E0
#define     REG_NAN_ATTRI_ID3               0x7E1
#define     REG_NAN_ATTRI_ID4               0x7E2
#define     REG_NAN_ENTRY_FLAG          0x7E3
#define     REG_NAN_START_OFFSET        0x7E4
#define     REG_NAN_RXA2_BITMAP         0x7E8


#define     REG_NAN_INTERFACE_ADDR                  0x2480     // 6 bytes
#define     REG_NAN_RANDOM_FACTOR                          0x2486     // 1 byte
#define     REG_NAN_MASTER_PREF                         0x2487     // 1 byte

