Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
//Current Anchor Master Record
#define     REG_NAN_CAMR_L                                      0x2488     // 4 bytes
#define     REG_NAN_CAMR_H                                     0x248C    // 4 byte
#define     REG_NAN_CAMR_AMBTT                         0x2490     // 4 bytes

//Last Anchor Master Record
#define     REG_NAN_LAMR_L                             0x2494     // 4 bytes
#define     REG_NAN_LAMR_H                                     0x2498     // 4 byte
#define     REG_NAN_LAMR_AMBTT                          0x249C    // 4 bytes

//TSF Synced:1bit
#define REG_NAN_TSF_SYNCED                     0x24A0    //BIT0



//-----------------------------------------------------
//
//  0x0800h ~ 0x0FFFh   BB Control Register setting
//
//-----------------------------------------------------
#define REG_RFE_INV                 0x092C
#define REG_RFE_CTRL89              0x0930
#define REG_RFE_SWCTRL              0x0948
#define REG_R_RFE_SEL01             0x0CB0
#define REG_R_RFE_SEL89             0x0CB4

#if 0

//-----------------------------------------------------
//
//  0xFB00h ~ 0xFCFFh   TX/RX packet buffer affress
//
//-----------------------------------------------------
#define REG_RXPKTBUF_STARTADDR      0xFB00
#define REG_TXPKTBUF_STARTADDR      0xFC00

//-----------------------------------------------------
//
//  0xFD00h ~ 0xFDFFh   8051 CPU Local REG
//
//-----------------------------------------------------
#define REG_SYS_CTRL            0xFD00
#define REG_PONSTS_RPT1         0xFD01
#define REG_PONSTS_RPT2         0xFD02
#define REG_PONSTS_RPT3         0xFD03
#define REG_PONSTS_RPT4         0xFD04  //0x94
#define REG_PONSTS_RPT5         0xFD05  //0x95
#define REG_8051ERRFLAG         0xFD08  
#define REG_8051ERRFLAG_MASK    0xFD09
#define REG_TXADDRH             0xFD10  //Tx Packet High Address
#define REG_RXADDRH             0xFD11  //Rx Packet High Address
#define REG_TXADDRH_EXT         0xFD12  //0xFD12[0] : for 8051 access txpktbuf high64k as external register

#define REG_U3_STATE            0xFD48  //(Read only) [7:4] : usb3 changed last state. [3:0]  usb3 state
#endif

//for MAILBOX 0x1160~0x1177
#define REG_OUTDATA0            0x0
#define REG_OUTDATA1            0x4
#define REG_OUTRDY              0x8  //bit[0] : OutReady, bit[1] : OutEmptyIntEn ,bit[7] : SW write 1 to clear OutReady

#define REG_INDATA0             0xC
#define REG_INDATA1             0x10
#define REG_INRDY               0x14  //bit[0] : InReady, bit[1] : InRdyIntEn

#if 0
#define REG_USB_D2F_MSG         0xFD70
#define REG_USB_F2D_MSG         0xFD74
#define REG_PCIE_D2F_MSG        0xFD78
#define REG_PCIE_F2D_MSG        0xFD7C
#define REG_SDIO_D2F_MSG        0xFD80
#define REG_SDIO_F2D_MSG        0xFD84


//MCU ERROR debug REG
#define REG_MCUERR_PCLSB        0xFD90  //PC[7:0]
#define REG_MCUERR_PCMSB        0xFD91  //PC[15:8]
#define REG_MCUERR_ACC          0xFD92
#define REG_MCUERR_B            0xFD93
#define REG_MCUERR_DPTRLSB      0xFD94  //DPTR[7:0]
#define REG_MCUERR_DPTRMSB      0xFD95  //DPTR[15:8]
#define REG_MCUERR_SP           0xFD96  //SP[7:0]
#define REG_MCUERR_IE           0xFD97  //IE[7:0]
#define REG_MCUERR_EIE          0xFD98  //EIE[7:0]
#define REG_VERA_SIM            0xFD9F
//0xFD99~0xFD9F are reserved.. 
#endif

//****************************************************//
//  Do not access 0xFE00~0xFEFF, 0xF000~0xF0FF !!
//****************************************************//
//-----------------------------------------------------
//
//  0xFE00h ~ 0xFEFFh   USB2 Configuration
//
//-----------------------------------------------------
#if 0
#define REG_USB_CTRL            0xFE10

//#define REG_CPWM2_USB2          0xFE34
//#define REG_HRPWM2_USB2         0xFE36

//-----------------------------------------------------
//
//  0xF000h ~ 0xF0FFh   USB3 Configuration
//
//-----------------------------------------------------
//#define REG_HRPWM_USB3          0xF052
//#define REG_CPWM_USB3           0xF053
//#define REG_CPWM2_USB3          0xF05C
//#define REG_HRPWM2_USB3         0xF05E
#endif




//============================================================================
//       8723B Regsiter Bit and Content definition 
//============================================================================
//-----------------------------------------------------
//
//  0x0000h ~ 0x00FFh   System Configuration
//
//-----------------------------------------------------
//2 SPS0_CTRL
#define SW18_FPWM                   BIT3


//2 SYS_ISO_CTRL
#define ISO_MD2PP                   BIT0
#define ISO_UA2USB                  BIT1
#define ISO_UD2CORE                 BIT2
#define ISO_PA2PCIE                 BIT3
#define ISO_PD2CORE                 BIT4
#define ISO_IP2MAC                  BIT5
#define ISO_DIOP                    BIT6
#define ISO_DIOE                    BIT7
#define ISO_EB2CORE                 BIT8
#define ISO_DIOR                    BIT9
#define UA12PC_EN                   BIT10   // For RTL8723 only.
#define UA33PC_EN                   BIT11   // For RTL8723 only.
#define PA12PC_EN                   BIT12   // For RTL8723 only.
#define PA33PC_EN                   BIT13   // For RTL8723 only.
#define PWC_EV25V                   BIT14
#define PWC_EV12V                   BIT15


//2 SYS_FUNC_EN
#define FEN_BBRSTB                  BIT0
#define FEN_BB_GLB_RSTn             BIT1
#define FEN_USBA                    BIT2
#define FEN_UPLL                    BIT3
#define FEN_USBD                    BIT4
#define FEN_DIO_PCIE                BIT5
#define FEN_PCIEA                   BIT6
#define FEN_PPLL                    BIT7
#define FEN_PCIED                   BIT8
#define FEN_DIOE                    BIT9
#define FEN_CPUEN                   BIT10
#define FEN_DCORE                   BIT11
#define FEN_ELDR                    BIT12
#define FEN_DIO_RF                  BIT13
#define FEN_HWPDN                   BIT14
#define FEN_MREGEN                  BIT15

//2 APS_FSMCO
#define PFM_LDALL                   BIT0
#define PFM_ALDN                    BIT1
#define PFM_LDKP                    BIT2
#define PFM_WOWL                    BIT3
#define EnPDN                       BIT4
#define PDN_PL                      BIT5
#define APFM_ONMAC                  BIT8
#define APFM_OFF                    BIT9
#define APFM_RSM                    BIT10
#define AFSM_HSUS                   BIT11
#define AFSM_PCIE                   BIT12
#define APDM_MAC                    BIT13
#define APDM_HOST                   BIT14
#define APDM_HPDN                   BIT15
#define RDY_MACON                   BIT16
#define SUS_HOST                    BIT17
#define ROP_ALD                     BIT20
#define ROP_PWR                     BIT21
#define ROP_SPS                     BIT22
#define SOP_MRST                    BIT25
#define SOP_FUSE                    BIT26
#define SOP_ABG                     BIT27
#define SOP_AMB                     BIT28
#define SOP_RCK                     BIT29
#define SOP_A8M                     BIT30
#define XOP_BTCK                    BIT31

//2 SYS_CLKR
#define ANAD16V_EN                  BIT0
#define ANA8M                       BIT1
#define MACSLP                      BIT4
#define LOADER_CLK_EN               BIT5
#define _80M_SSC_DIS                BIT7
#define _80M_SSC_EN_HO              BIT8
#define PHY_SSC_RSTB                BIT9
#define SEC_CLK_EN                  BIT10
#define MAC_CLK_EN                  BIT11
#define SYS_CLK_EN                  BIT12
#define RING_CLK_EN                 BIT13
#define CPU_CLK_EN                  BIT14


