Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
//2 9346CR

#define     BOOT_FROM_EEPROM        BIT4
#define     EEPROM_EN               BIT5


//2 AFE_MISC
#define AFE_BGEN                    BIT0
#define AFE_MBEN                    BIT1
#define MAC_ID_EN                   BIT7


//2 SPS0_CTRL


//2 SPS_OCP_CFG


//2 RSV_CTRL
#define WLOCK_ALL                   BIT0
#define WLOCK_00                    BIT1
#define WLOCK_04                    BIT2
#define WLOCK_08                    BIT3
#define WLOCK_40                    BIT4
#define R_DIS_PRST_0                BIT5
#define R_DIS_PRST_1                BIT6
#define LOCK_ALL_EN                 BIT7

//2 RF_CTRL
#define RF_EN                       BIT0
#define RF_RSTB                     BIT1
#define RF_SDMRSTB                  BIT2



//2 LDOA15_CTRL
#define LDA15_EN                    BIT0
#define LDA15_STBY                  BIT1
#define LDA15_OBUF                  BIT2
#define LDA15_REG_VOS               BIT3
#define _LDA15_VOADJ(x)             (((x) & 0x7) << 4)



//2 LDOV12D_CTRL
#define LDV12_EN                    BIT0
#define LDV12_SDBY                  BIT1
#define LPLDO_HSM                   BIT2
#define LPLDO_LSM_DIS               BIT3
#define _LDV12_VADJ(x)              (((x) & 0xF) << 4)


//2 AFE_XTAL_CTRL
#define XTAL_EN                     BIT0
#define XTAL_BSEL                   BIT1
#define _XTAL_BOSC(x)               (((x) & 0x3) << 2)
#define _XTAL_CADJ(x)               (((x) & 0xF) << 4)
#define XTAL_GATE_USB               BIT8
#define _XTAL_USB_DRV(x)            (((x) & 0x3) << 9)
#define XTAL_GATE_AFE               BIT11
#define _XTAL_AFE_DRV(x)            (((x) & 0x3) << 12)
#define XTAL_RF_GATE                BIT14
#define _XTAL_RF_DRV(x)             (((x) & 0x3) << 15)
#define XTAL_GATE_DIG               BIT17
#define _XTAL_DIG_DRV(x)            (((x) & 0x3) << 18)
#define XTAL_BT_GATE                BIT20
#define _XTAL_BT_DRV(x)             (((x) & 0x3) << 21)
#define _XTAL_GPIO(x)               (((x) & 0x7) << 23)


#define CKDLY_AFE                   BIT26
#define CKDLY_USB                   BIT27
#define CKDLY_DIG                   BIT28
#define CKDLY_BT                    BIT29


//2 AFE_PLL_CTRL
#define APLL_EN                     BIT0
#define APLL_320_EN                 BIT1
#define APLL_FREF_SEL               BIT2
#define APLL_EDGE_SEL               BIT3
#define APLL_WDOGB                  BIT4
#define APLL_LPFEN                  BIT5

#define APLL_REF_CLK_13MHZ          0x1
#define APLL_REF_CLK_19_2MHZ        0x2
#define APLL_REF_CLK_20MHZ          0x3
#define APLL_REF_CLK_25MHZ          0x4
#define APLL_REF_CLK_26MHZ          0x5
#define APLL_REF_CLK_38_4MHZ        0x6
#define APLL_REF_CLK_40MHZ          0x7

#define APLL_320EN                  BIT14
#define APLL_80EN                   BIT15
#define APLL_1MEN                   BIT24


//2 EFUSE_CTRL
#define ALD_EN                      BIT18
#define EF_PD                       BIT19
#define EF_FLAG                     BIT31

//2 EFUSE_TEST (For RTL8723 partially)
#define EF_TRPT                     BIT7
#define EF_CELL_SEL                 (BIT8|BIT9) // 00: Wifi Efuse, 01: BT Efuse0, 10: BT Efuse1, 11: BT Efuse2
#define LDOE25_EN                   BIT31
#define EFUSE_SEL(x)                (((x) & 0x3) << 8)
#define EFUSE_SEL_MASK              0x300
#define EFUSE_WIFI_SEL_0            0x0
#define EFUSE_BT_SEL_0              0x1
#define EFUSE_BT_SEL_1              0x2
#define EFUSE_BT_SEL_2              0x3

#define EFUSE_ACCESS_ON             0x69    // For RTL8723 only.
#define EFUSE_ACCESS_OFF            0x00    // For RTL8723 only.

//2 PWR_DATA 

//2 CAL_TIMER

//2 ACLK_MON
#define RSM_EN                      BIT0
#define Timer_EN                    BIT4


//2 GPIO_MUXCFG
#define TRSW0EN                     BIT2
#define TRSW1EN                     BIT3
#define EROM_EN                     BIT4
#define EnBT                        BIT5
#define EnUart                      BIT8
#define Uart_910                    BIT9
#define EnPMAC                      BIT10
#define SIC_SWRST                   BIT11
#define EnSIC                       BIT12
#define SIC_23                      BIT13
#define EnHDP                       BIT14
#define SIC_LBK                     BIT15

//2 GPIO_PIN_CTRL



//2 GPIO_INTM

//2 LEDCFG
#define LED0PL                      BIT4  
#define LED1PL                      BIT12
#define LED0DIS                     BIT7


//2 FSIMR
//2 FSISR
#define SYSINT_GPIO0_SHT            4//12
#define SYSINT_GPIO1_SHT            5//13
#define SYSINT_GPIO2_SHT            6//14
#define SYSINT_GPIO3_SHT            7//15

#define SYSINT_GPIO4_SHT            0//16
#define SYSINT_GPIO5_SHT            1//17
#define SYSINT_GPIO6_SHT            2//18
#define SYSINT_GPIO7_SHT            3//19
#define SYSINT_GPIO8_SHT            4//20
#define SYSINT_GPIO9_SHT            5//21
#define SYSINT_GPIOA_SHT            6//22
#define SYSINT_GPIOB_SHT            7//23

#define SYSINT_HPON_WRE_SHT         4//28   
#define SYSINT_SPS_OCP_SHT          5//29
#define SYSINT_HWSYS_TIMER_SHT      6//30
#define SYSINT_PDNINT_SHT           7//31


#define SYSINT_GPIO0INT             BIT(SYSINT_GPIO0_SHT)
#define SYSINT_GPIO1INT             BIT(SYSINT_GPIO1_SHT)
#define SYSINT_GPIO2INT             BIT(SYSINT_GPIO2_SHT)
#define SYSINT_GPIO3INT             BIT(SYSINT_GPIO3_SHT)

#define SYSINT_GPIO4INT             BIT(SYSINT_GPIO4_SHT)
#define SYSINT_GPIO5INT             BIT(SYSINT_GPIO5_SHT)
#define SYSINT_GPIO6INT             BIT(SYSINT_GPIO6_SHT)
#define SYSINT_GPIO7INT             BIT(SYSINT_GPIO7_SHT)
#define SYSINT_GPIO8INT             BIT(SYSINT_GPIO8_SHT)
#define SYSINT_GPIO9INT             BIT(SYSINT_GPIO9_SHT)
#define SYSINT_GPIOAINT             BIT(SYSINT_GPIOA_SHT)

#define SYSINT_HPON_WRE             BIT(SYSINT_HPON_WRE_SHT)
#define SYSINT_SPS_OCP              BIT(SYSINT_SPS_OCP_SHT)
#define SYSINT_HWSYS_TIMER          BIT(SYSINT_HWSYS_TIMER_SHT)
#define SYSINT_PDNINT               BIT(SYSINT_PDNINT_SHT)

//2 WLAN CLK CTRL+1      0x0003
#define BIT_TSF_CKSLP_SEL       BIT0

//2 WLAN PHY EN        0x0006
#define BIT_FEN_BB_GLB_RST     BIT0
#define BIT_FEN_BB_RSTB              BIT1

//2WLAN RF EN       0x0007
#define BIT_RF_EN           BIT0
#define BIT_RF_RSTB         BIT1
#define BIT_RF_SDMRSTB      BIT2

//2 WLAN PMC CTRL       0x0020
#define BIT_WL_PMC_LPS_EN   BIT2

//2 MCUFWDL     0x0080
#define MCUFWDL_EN                  BIT0
#define MCUFWDL_RDY                 BIT1
#define MCUFWDL_CHK_RPT             BIT2
//#define MACINI_RDY                  BIT3
//#define BBINI_RDY                   BIT4
//#define RFINI_RDY                   BIT5
#define WINTINI_RDY                 BIT6
#define RAM_DL_SEL                  BIT7


#define MCU_ROM_INITIAL_READY       BIT2    //10

#define ROMDLFW_EN                  BIT3    //11    
#define FWDL2TXBUF_RDY              BIT4    //12
#define MCUFWDL_DMA_EN      BIT5    //13

