Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
#define ROM_DLEN                    BIT3    //19
#define CPRST                       BIT7    //23

//2 REG_USB_SIE_INTF        0x00E0
#define USB2_SIE_READ               0x01          
#define USB2_SIE_WRITE              0x03
#define USB3_SIE_READ               0x40
#define USB3_SIE_WRITE              0x42
#define USB_WRITE_END               BIT0
#define USB_SIE_INTF_WE             BIT1


//2 REG_PCIE_MIO_INTF       0x00E4
#define PCIE_MIO_WRITE              0x20
#define PCIE_MIO_READ               0x30


//2 REG_PCIE_MIO_INTD       0x00E8


//2 REG_HPON_FSM
#define BOND92CE_1T2R_CFG           BIT22


//2 REG_SYS_CFG
#define XCLK_VLD                    BIT0
#define ACLK_VLD                    BIT1
#define UCLK_VLD                    BIT2
#define PCLK_VLD                    BIT3
#define PCIRSTB                     BIT4
#define V15_VLD                     BIT5
//#define TRP_B15V_EN                 BIT7
#define INIT_OFFLOAD_ROM_EN         BIT7 
#define SIC_IDLE                    BIT8
#define BD_MAC2                     BIT9
#define BD_MAC1                     BIT10
#define IC_MACPHY_MODE              BIT11
#define CHIP_VER                    (BIT12|BIT13|BIT14|BIT15)
#define BT_FUNC                     BIT16
#define VENDOR_ID                   BIT19
#define PAD_HWPD_IDN                BIT22
#define TRP_VAUX_EN                 BIT23   // RTL ID
#define TRP_BT_EN                   BIT24
#define BD_PKG_SEL                  BIT25
#define BD_HCI_SEL                  BIT26
#define TYPE_ID                     BIT27

#define CHIP_VER_RTL_MASK           0xF000  //Bit 12 ~ 15
#define CHIP_VER_RTL_SHIFT          12

//2REG_GPIO_OUTSTS (For RTL8723 only)
//2 REG_SYS_STATUS_RPT
#define EFS_HCI_SEL                 (BIT0|BIT1)
#define PAD_HCI_SEL                 (BIT2|BIT3)
#define HCI_SEL                     (BIT4|BIT5) //8723BA
#define PKG_SEL_HCI                 BIT6
#define FEN_GPS                     BIT7
#define FEN_BT                      BIT8
#define FEN_WL                      BIT9
#define FEN_PCI                     BIT10
#define FEN_USB                     BIT11
#define BTRF_HWPDN_N                BIT12
#define WLRF_HWPDN_N                BIT13
#define PDN_BT_N                    BIT14
#define PDN_GPS_N                   BIT15
#define BT_CTL_HWPDN                BIT16
#define GPS_CTL_HWPDN               BIT17
#define PPHY_SUSB                   BIT20
#define UPHY_SUSB                   BIT21
#define PCI_SUSEN                   BIT22
#define USB_SUSEN                   BIT23

#define RF_RL_ID                    (BIT31|BIT30|BIT29|BIT28)
#define TRAP_PKG_SEL                BIT5
//#define   HCI_SEL                     (BIT6|BIT7) //8188E

//2 REG_USB_CFG
#define USB2_SEL                    BIT7
//-----------------------------------------------------
//
//  0x0100h ~ 0x01FFh   MACTOP General Configuration
//
//-----------------------------------------------------


//2 Function Enable Registers

#define REG_LBMODE                  (REG_FUNC_ENABLE + 3)


#define HCI_TXDMA_EN                BIT0
#define HCI_RXDMA_EN                BIT1
#define TXDMA_EN                    BIT2
#define RXDMA_EN                    BIT3
#define PROTOCOL_EN                 BIT4
#define SCHEDULE_EN                 BIT5
#define MACTXEN                     BIT6
#define MACRXEN                     BIT7

#define ENSWBCN                     BIT0
#define ENSEC                       BIT1

#define FUNC_EN_TX_PATH             (HCI_TXDMA_EN/*|TXDMA_EN*/|PROTOCOL_EN|SCHEDULE_EN|MACTXEN)
                                    //for dynamic LLT initialization, TXDMA_EN shall not be reset.
#define FUNC_EN_RX_PATH             (HCI_RXDMA_EN|RXDMA_EN|MACRXEN)


// Network type
#define _NETTYPE(x)                 (((x) & 0x3) << 16)
#define MASK_NETTYPE                0x30000
#define NT_NO_LINK                  0x0
#define NT_LINK_AD_HOC              0x1
#define NT_LINK_AP                  0x2
#define NT_AS_AP                    0x3

#define _LBMODE(x)                  (((x) & 0xF) << 24)
#define MASK_LBMODE                 0xF000000
#define LOOPBACK_NORMAL             0x0
#define LOOPBACK_IMMEDIATELY        0xB
#define LOOPBACK_MAC_DELAY          0x3
#define LOOPBACK_PHY                0x1
#define LOOPBACK_DMA                0x7


//2 PLAYFORM_CLOCK Register 0x0109
#define CLK_STABLE_32K              BIT7        // 1: 32K Stable, 0: 40M Stable

//2 PBP - Page Size Register
#define GET_RX_PAGE_SIZE(value)     ((value) & 0xF)
#define GET_TX_PAGE_SIZE(value)     (((value) & 0xF0) >> 4)
#define _PSRX_MASK                  0xF
#define _PSTX_MASK                  0xF0
#define _PSRX(x)                    (x)
#define _PSTX(x)                    ((x) << 4)

#define PBP_64                      0x0
#define PBP_128                     0x1
#define PBP_256                     0x2
#define PBP_512                     0x3
#define PBP_1024                    0x4


//2 TX/RXDMA
#define RXDMA_ARBBW_EN              BIT0
#define RXSHFT_EN                   BIT1
#define RXDMA_AGG_EN                BIT2
#define QS_VO_QUEUE                 BIT8
#define QS_VI_QUEUE                 BIT9
#define QS_BE_QUEUE                 BIT10
#define QS_BK_QUEUE                 BIT11
#define QS_MANAGER_QUEUE            BIT12
#define QS_HIGH_QUEUE               BIT13

#define HQSEL_VOQ                   BIT0
#define HQSEL_VIQ                   BIT1
#define HQSEL_BEQ                   BIT2
#define HQSEL_BKQ                   BIT3
#define HQSEL_MGTQ                  BIT4
#define HQSEL_HIQ                   BIT5

// For normal driver, 0x10C
#define _TXDMA_HIQ_MAP(x)           (((x)&0x3) << 14)
#define _TXDMA_MGQ_MAP(x)           (((x)&0x3) << 12)
#define _TXDMA_BKQ_MAP(x)           (((x)&0x3) << 10)       
#define _TXDMA_BEQ_MAP(x)           (((x)&0x3) << 8 )
#define _TXDMA_VIQ_MAP(x)           (((x)&0x3) << 6 )
#define _TXDMA_VOQ_MAP(x)           (((x)&0x3) << 4 )

#define QUEUE_LOW                   1
#define QUEUE_NORMAL                2
#define QUEUE_HIGH                  3



//2 TRXFF_BNDY


//2 FWIMR / FWISR

#define WLANINT_TXCLOSE_SHT        0
#define WLANINT_TXCCX_SHT          1
#define WLANINT_ERRORHDL_SHT       2
#define WLANINT_RXDONE_SHT         3
#define WLANINT_H2CCMD_SHT         4
#define WLANINT_HRCV_SHT           5
#define WLANINT_CTW_SHT            6
#define WLANINT_LPSTBY_SHT         7

#define WLANINT_BCNDMA0INT_SHT     0//8    
#define WLANINT_BCNDMA1INT_SHT     1//9
#define WLANINT_BCNDMA2INT_SHT     2//10
#define WLANINT_BCNDMA3INT_SHT     3//11
#define WLANINT_BCNDMA4INT_SHT     4//12
#define WLANINT_BCNDMA5INT_SHT     5//13
#define WLANINT_BCNDMA6INT_SHT     6//14
#define WLANINT_BCNDMA7INT_SHT     7//15

#define WLANINT_BCNERLY_SHT        0//16
#define WLANINT_TBTTINT_SHT        1//17
#define WLANINT_BCNRX_SHT          2//18
#define WLANINT_RXBMD1_SHT         3//19
#define WLANINT_RXBMD0_SHT         4//20
#define WLANINT_RXUMD1_SHT         5//21
#define WLANINT_RXUMD0_SHT         6//22
#define WLANINT_TXBCNERR_SHT       7//23

#define WLANINT_TXBCNOK_SHT        0//24
#define WLANINT_TXPKTIN_SHT        1//25
#define WLANINT_WLAN_ACT_ON_SHT    2//26
#define WLANINT_WLAN_ACT_OFF_SHT   3//27
#define WLANINT_TXRPT_CNT_FULL_SHT 4//28
#define WLANINT_TRYDONE_SHT        5//29
#define WLANINT_SOUND_DONE_SHT     6//30
//#define WLANINT_VOQINT_SHT         7//31



