Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
// 0~7
#define WLANINT_TXCLOSE             BIT(WLANINT_TXCLOSE_SHT)
#define WLANINT_TXCCX               BIT(WLANINT_TXCCX_SHT)
#define WLANINT_ERRORHDL            BIT(WLANINT_ERRORHDL_SHT)
#define WLANINT_RXDONE              BIT(WLANINT_RXDONE_SHT)
#define WLANINT_H2CCMD              BIT(WLANINT_H2CCMD_SHT)
#define WLANINT_HRCV                BIT(WLANINT_HRCV_SHT)
#define WLANINT_CTW                 BIT(WLANINT_CTW_SHT)        //In 88C/8723 test chip, it is shared by CTWindow and ATIMWindow. In 8723 Normal Chip, CTWindow and ATIMWindow are separated.
#define WLANINT_LPSTBY              BIT(WLANINT_LPSTBY_SHT)

// 8~15
#define WLANINT_BCNDMA0INT          BIT(WLANINT_BCNDMA0INT_SHT)
#define WLANINT_BCNDMA1INT          BIT(WLANINT_BCNDMA1INT_SHT)
#define WLANINT_BCNDMA2INT          BIT(WLANINT_BCNDMA2INT_SHT)
#define WLANINT_BCNDMA3INT          BIT(WLANINT_BCNDMA3INT_SHT)
#define WLANINT_BCNDMA4INT          BIT(WLANINT_BCNDMA4INT_SHT)
#define WLANINT_BCNDMA5INT          BIT(WLANINT_BCNDMA5INT_SHT)
#define WLANINT_BCNDMA6INT          BIT(WLANINT_BCNDMA6INT_SHT)
#define WLANINT_BCNDMA7INT          BIT(WLANINT_BCNDMA7INT_SHT)

//16~23
#define WLANINT_BCNERLY             BIT(WLANINT_BCNERLY_SHT)
#define WLANINT_TBTTINT             BIT(WLANINT_TBTTINT_SHT)
#define WLANINT_BCNRX               BIT(WLANINT_BCNRX_SHT)
#define WLANINT_RXBMD1              BIT(WLANINT_RXBMD1_SHT)
#define WLANINT_RXBMD0              BIT(WLANINT_RXBMD0_SHT)
#define WLANINT_RXUMD1              BIT(WLANINT_RXUMD1_SHT)
#define WLANINT_RXUMD0              BIT(WLANINT_RXUMD0_SHT  )
#define WLANINT_TXBCNERR            BIT(WLANINT_TXBCNERR_SHT)


//24~31
#define WLANINT_TXBCNOK             BIT(WLANINT_TXBCNOK_SHT)
#define WLANINT_TXPKTIN             BIT(WLANINT_TXPKTIN_SHT)
#define WLANINT_WLAN_ACT_ON         BIT(WLANINT_WLAN_ACT_ON_SHT)
#define WLANINT_WLAN_ACT_OFF        BIT(WLANINT_WLAN_ACT_OFF_SHT)
#define WLANINT_TXRPT_CNT_FULL      BIT(WLANINT_TXRPT_CNT_FULL_SHT)
#define WLANINT_TRYDONE             BIT(WLANINT_TRYDONE_SHT)
#define WLANINT_SOUND_DONE          BIT(WLANINT_SOUND_DONE_SHT)
//#define WLANINT_VOQINT              BIT(WLANINT_VOQINT_SHT)


//3 FWIMR2 / FWISR2

#define WLANINT2_SYNCBCN_RXOK_SHT     0//8
#define WLANINT2_TBTT1_SHT            5//13
#define WLANINT2_DW_EARLY_SHT         6//14
#define WLANINT2_DW_END_SHT           7//15

#define WLANINT2_SYNCBCN_TXERR_SHT    0//16
#define WLANINT2_SYNCBCN_TXOK_SHT     1//17
#define WLANINT2_EQ_EARLY_SHT         2//18
#define WLANINT2_EQ_TXOK_SHT          3//19
#define WLANINT2_DDMA_HP_DONE_SHT     4//20 DDMA channel 0 and 1
#define WLANINT2_DDMA_LP_DONE_SHT     5//21 DDMA channel 2,3,4,5
#define WLANINT2_HIOE_DONE_SHT        6//22
#define WLANINT2_GNT_BT_RISE_SHT      7//23

#define WLANINT2_GNT_BT_FALL_SHT      0//24
#define WLANINT2_SCORE_BOARD_SHT      1//25

#define WLANINT2_1_WIRED_MAILBOX_SHT  3//27






//0~7


//8~15
#define WLANINT2_SYNCBCN_RXOK           BIT(WLANINT2_SYNCBCN_RXOK_SHT)
#define WLANINT2_TBTT1                  BIT(WLANINT2_TBTT1_SHT)
#define WLANINT2_DW_EARLY               BIT(WLANINT2_DW_EARLY_SHT)
#define WLANINT2_DW_END                 BIT(WLANINT2_DW_END_SHT)

//16~23
#define WLANINT2_SYNCBCN_TXERR          BIT(WLANINT2_SYNCBCN_TXERR_SHT)
#define WLANINT2_SYNCBCN_TXOK           BIT(WLANINT2_SYNCBCN_TXOK_SHT)
#define WLANINT2_EQ_EARLY               BIT(WLANINT2_EQ_EARLY_SHT)
#define WLANINT2_EQ_TXOK                BIT(WLANINT2_EQ_TXOK_SHT)
#define WLANINT2_DDMA_HP_DONE           BIT(WLANINT2_DDMA_HP_DONE_SHT)
#define WLANINT2_DDMA_LP_DONE           BIT(WLANINT2_DDMA_LP_DONE_SHT)
#define WLANINT2_HIOE_DONE              BIT(WLANINT2_HIOE_DONE_SHT)
#define WLANINT2_GNT_BT_RISE            BIT(WLANINT2_GNT_BT_RISE_SHT)

//24~31
#define WLANINT2_GNT_BT_FALL            BIT(WLANINT2_GNT_BT_FALL_SHT)
#define WLANINT2_SCORE_BOARD            BIT(WLANINT2_SCORE_BOARD_SHT)

#define WLANINT2_1_WIRED_MAILBOX        BIT(WLANINT2_1_WIRED_MAILBOX_SHT)




//2 FTIMR / FTISR
#define FTINT_GTINT0_SHT            0
#define FTINT_GTINT1_SHT            1
#define FTINT_GTINT2_SHT            2
#define FTINT_GTINT3_SHT            3
#define FTINT_GTINT4_SHT            4
#define FTINT_TIMEOUT0_SHT          5
#define FTINT_TIMEOUT1_SHT          6
#define FTINT_PSTIMER_SHT           7

#define FTINT_RPWMINT_SHT           0//8
#define FTINT_BCNRX_E_SHT           1//9
#define FTINT_EOSP_SHT              2//10
#define FTINT_GTINT5_SHT            3//11
#define FTINT_BCNERLY1_SHT          4//12
#define FTINT_ATIM1_SHT             5//13


#define FTINT_P2P_RFON_SHT          0//16
#define FTINT_P2P_RFOFF_SHT         1//17
#define FTINT_BTCMD_SHT             2//18
#define FTINT_TRIGGER_PKT_SHT       3//19
#define FTINT_TSF_BIT32TGL_SHT      4//20
#define FTINT_RPWMINT2_SHT          5//21
#define FTINT_RETRIVE_BUFFERED_SHT  6//22
#define FTINT_CLR_PS_STATUS_SHT     7//23


#define FTINT_C2H_W_READY_SHT       1//25
#define FTINT_RX_WAKEUP_PKT_SHT     2//26
#define FTINT_ATIM_SHT              3//27
#define FTINT_BCN_ELY_AGG_SHT       4//28
#define FTINT_TXNULL0_SHT           5//29
#define FTINT_TXNULL1_SHT           6//30
#define FTINT_GTINT6_SHT            7//31

//0~7
#define FTINT_GTINT0            BIT(FTINT_GTINT0_SHT)
#define FTINT_GTINT1            BIT(FTINT_GTINT1_SHT)
#define FTINT_GTINT2            BIT(FTINT_GTINT2_SHT)
#define FTINT_GTINT3            BIT(FTINT_GTINT3_SHT)
#define FTINT_GTINT4            BIT(FTINT_GTINT4_SHT)
#define FTINT_TIMEOUT0          BIT(FTINT_TIMEOUT0_SHT)
#define FTINT_TIMEOUT1          BIT(FTINT_TIMEOUT1_SHT)
#define FTINT_PSTIMER           BIT(FTINT_PSTIMER_SHT)  

//8~15
#define FTINT_RPWMINT           BIT(FTINT_RPWMINT_SHT)
#define FTINT_BCNRX_E           BIT(FTINT_BCNRX_E_SHT)
#define FTINT_EOSP              BIT(FTINT_EOSP_SHT)
#define FTINT_GTINT5            BIT(FTINT_GTINT5_SHT)
#define FTINT_BCNERLY1          BIT(FTINT_BCNERLY1_SHT)
#define FTINT_ATIM1             BIT(FTINT_ATIM1_SHT)

//16~23
#define FTINT_P2P_RFON          BIT(FTINT_P2P_RFON_SHT)
#define FTINT_P2P_RFOFF         BIT(FTINT_P2P_RFOFF_SHT)
#define FTINT_BTCMD             BIT(FTINT_BTCMD_SHT)
#define FTINT_TRIGGER_PKT       BIT(FTINT_TRIGGER_PKT_SHT)
#define FTINT_TSF_BIT32TGL      BIT(FTINT_TSF_BIT32TGL_SHT)
#define FTINT_RPWMINT2          BIT(FTINT_RPWMINT2_SHT)
#define FTINT_RETRIVE_BUFFERED  BIT(FTINT_RETRIVE_BUFFERED_SHT)
#define FTINT_CLR_PS_STATUS     BIT(FTINT_CLR_PS_STATUS_SHT)

