Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
//24~31
#define FTINT_C2H_W_READY       BIT(FTINT_C2H_W_READY_SHT)
#define FTINT_RX_WAKEUP_PKT     BIT(FTINT_RX_WAKEUP_PKT_SHT)
#define FTINT_ATIM              BIT(FTINT_ATIM_SHT)     //Added in 8723 Normal Chip.
#define FTINT_BCN_ELY_AGG       BIT(FTINT_BCN_ELY_AGG_SHT)
#define FTINT_TXNULL0           BIT(FTINT_TXNULL0_SHT)  //Added in 8179 test chip
#define FTINT_TXNULL1           BIT(FTINT_TXNULL1_SHT)  //Added in 8179 test chip
#define FTINT_GTINT6            BIT(FTINT_GTINT6_SHT)

//3 FTIMR2 / FTISR2

#define FTINT2_BT_MAILBOX_SHT   0 //0


//0~7
#define FTINT2_BT_MAILBOX       BIT(FTINT2_BT_MAILBOX_SHT)

//8~15


//16~23


//2 General Purpose Timer (Offset: 0x0150 - 0x016Fh)
#define MODE_TIMER                  1
#define MODE_COUNTER                0

#define TC_ENABLE                   BIT0
#define TC_TIMER_MODE               BIT1        


//2 HMETFR
#define H2CINTBOX_BITMASK           0xF
#define H2CINTBOX_NUMMASK           0x3


//2 LLT_INIT
#define _LLT_NO_ACTIVE              0x00
#define _LLT_WRITE_ACCESS           0x40
#define _LLT_READ_ACCESS            0x80

#define _LLT_INIT_DATA(x)           ((x) & 0xFF)
#define _LLT_INIT_ADDR(x)           (((x) & 0xFF) << 8)
#define _LLT_OP(x)                  (((x) & 0x3) << 30)
#define _LLT_OP_VALUE(x)            (((x) >> 30) & 0x3)



//2 BB_ACCESS_CTRL
#define BB_WRITE_READ_MASK          (BIT31 | BIT30)
#define BB_WRITE_EN                 BIT30
#define BB_READ_EN                  BIT31
//#define BB_ADDR_MASK              0xFFF
//#define _BB_ADDR(x)                   ((x) & BB_ADDR_MASK)

//-----------------------------------------------------
//
//  0x0200h ~ 0x027Fh   TXDMA Configuration
//
//-----------------------------------------------------
//2 RQPN
#define _HPQ(x)                     ((x) & 0xFF)
#define _LPQ(x)                     (((x) & 0xFF) << 8)
#define _PUBQ(x)                    (((x) & 0xFF) << 16)
#define _NPQ(x)                     ((x) & 0xFF)            // NOTE: in RQPN_NPQ register


#define HPQ_PUBLIC_DIS              BIT24
#define LPQ_PUBLIC_DIS              BIT25
#define LD_RQPN                     BIT31


//2 TDECTRL
#define BCN_VALID                   BIT16
#define BCN_HEAD(x)                 (((x) & 0xFF) << 8)
#define BCN_HEAD_MASK               0xFF00

//2 TDECTL
#define BLK_DESC_NUM_SHIFT          4
#define BLK_DESC_NUM_MASK           0xF


//2 TXDMA_OFFSET_CHK
#define DROP_DATA_EN                BIT9


//2 RX pkt unm  0x286
#define RXDMA_IDLE                  BIT1
#define STOP_RXDMA                  BIT2



//-----------------------------------------------------
//
//  0x0300h ~ 0x03FFh   PCIE 
//
//-----------------------------------------------------
//2  REG_DBI_CTRL                   0x0350

//2 REG_DBI_RWCMD               0x0352
#define DBI_WRITE                   BIT0
#define DBI_READ                    BIT1


//2 REG_MDIO_CTRL               0x0358
#define MDIO_PCIE_READ              BIT6
#define MDIO_PCIE_WRITE             BIT5

//-----------------------------------------------------
//
//  0x0400h ~ 0x047Fh   Protocol Configuration
//
//-----------------------------------------------------

//2 CPU_MGT_INFORMATION
#define CPUMGT_POLL                 BIT5
#define P0BCN_POLL                  BIT4
#define P1BCN_POLL                  BIT6
#define NANBCN_POLL                 BIT7


//2 FWHW_TXQ_CTRL
#define EN_AMPDU_RTY_NEW            BIT7

//2 INIRTSMCS_SEL
#define _INIRTSMCS_SEL(x)           ((x) & 0x3F)


//2 SPEC SIFS
#define _SPEC_SIFS_CCK(x)           ((x) & 0xFF)
#define _SPEC_SIFS_OFDM(x)          (((x) & 0xFF) << 8)


//2 RRSR

#define RATE_REG_BITMAP_ALL         0xFFFFF

#define _RRSC_BITMAP(x)             ((x) & 0xFFFFF)

#define _RRSR_RSC(x)                (((x) & 0x3) << 21)
#define RRSR_RSC_RESERVED           0x0
#define RRSR_RSC_UPPER_SUBCHANNEL   0x1
#define RRSR_RSC_LOWER_SUBCHANNEL   0x2
#define RRSR_RSC_DUPLICATE_MODE     0x3


//2 ARFR
#define USE_SHORT_G1                BIT20

//2 AGGLEN_LMT_L
#define _AGGLMT_MCS0(x)             ((x) & 0xF)
#define _AGGLMT_MCS1(x)             (((x) & 0xF) << 4)
#define _AGGLMT_MCS2(x)             (((x) & 0xF) << 8)
#define _AGGLMT_MCS3(x)             (((x) & 0xF) << 12)
#define _AGGLMT_MCS4(x)             (((x) & 0xF) << 16)
#define _AGGLMT_MCS5(x)             (((x) & 0xF) << 20)
#define _AGGLMT_MCS6(x)             (((x) & 0xF) << 24)
#define _AGGLMT_MCS7(x)             (((x) & 0xF) << 28)

//3 LIFETIME_CTRL
#define BT_INT_MCU                  BIT7
#define BT_INT_PTA                  BIT6

//2 RL
#define RETRY_LIMIT_SHORT_SHIFT     8
#define RETRY_LIMIT_LONG_SHIFT      0


//2 DARFRC
#define _DARF_RC1(x)                ((x) & 0x1F)
#define _DARF_RC2(x)                (((x) & 0x1F) << 8)
#define _DARF_RC3(x)                (((x) & 0x1F) << 16)
#define _DARF_RC4(x)                (((x) & 0x1F) << 24)
// NOTE: shift starting from address (DARFRC + 4)
#define _DARF_RC5(x)                ((x) & 0x1F)
#define _DARF_RC6(x)                (((x) & 0x1F) << 8)
#define _DARF_RC7(x)                (((x) & 0x1F) << 16)
#define _DARF_RC8(x)                (((x) & 0x1F) << 24)


//2 RARFRC
#define _RARF_RC1(x)                ((x) & 0x1F)
#define _RARF_RC2(x)                (((x) & 0x1F) << 8)
#define _RARF_RC3(x)                (((x) & 0x1F) << 16)
#define _RARF_RC4(x)                (((x) & 0x1F) << 24)
// NOTE: shift starting from address (RARFRC + 4)
#define _RARF_RC5(x)                ((x) & 0x1F)
#define _RARF_RC6(x)                (((x) & 0x1F) << 8)
#define _RARF_RC7(x)                (((x) & 0x1F) << 16)
#define _RARF_RC8(x)                (((x) & 0x1F) << 24)




//-----------------------------------------------------
//
//  0x0500h ~ 0x05FFh   EDCA Configuration
//
//-----------------------------------------------------



//2 EDCA setting
#define AC_PARAM_TXOP_LIMIT_OFFSET  16
#define AC_PARAM_ECW_MAX_OFFSET     12
#define AC_PARAM_ECW_MIN_OFFSET     8
#define AC_PARAM_AIFS_OFFSET        0


//2 EDCA_VO_PARAM
#define _AIFS(x)                    (x)
#define _ECW_MAX_MIN(x)             ((x) << 8)
#define _TXOP_LIMIT(x)              ((x) << 16)


#define _BCNIFS(x)                  ((x) & 0xFF)
#define _BCNECW(x)                  (((x) & 0xF))<< 8)


#define _LRL(x)                     ((x) & 0x3F)
#define _SRL(x)                     (((x) & 0x3F) << 8)


//2 SIFS_CCK
#define _SIFS_CCK_CTX(x)            ((x) & 0xFF)
#define _SIFS_CCK_TRX(x)            (((x) & 0xFF) << 8);


//2 SIFS_OFDM
#define _SIFS_OFDM_CTX(x)           ((x) & 0xFF)
#define _SIFS_OFDM_TRX(x)           (((x) & 0xFF) << 8);


//2 TXPAUSE 0x522
#define MAC_STOPBK                  BIT0
#define MAC_STOPBE                  BIT1
#define MAC_STOPVI                  BIT2
#define MAC_STOPVO                  BIT3
#define MAC_STOPMGQ                 BIT4
#define MAC_STOPHIQ                 BIT5
#define MAC_STOPBCNQ                BIT6
#define MAC_STOP_BCN_HI_MGT         BIT7


//2 TBTT PROHIBIT
#define _TBTT_PROHIBIT_HOLD(x)      (((x) & 0xFF) << 8)


//2 REG_RD_CTRL 0x524
#define DIS_EDCA_CNT_DWN            BIT11

//2 MBSSID_CTRL 0x526

//2 P2PPS_CTRL 0x527
#define P2P_BCN_SEL                 BIT0
#define P2P_NOA0_EN                 BIT1
#define P2P_NOA1_EN                 BIT2
#define P2P_CTWND_EN                BIT3
#define P2P_BCN_AREA_EN             BIT4
#define P2P_PWR_MGT_EN              BIT5
#define P2P_OFF_DISTX_EN            BIT6
#define P2P_CTW_ALLSTASLEEP         BIT7


//2 P2PPS_SPEC_STATE 0x52B
#define P2P_SPEC_FORCE_DOZE0        BIT0
#define P2P_SPEC_NOA0_OFF_PERIOD    BIT1
#define P2P_SPEC_FORCE_DOZE1        BIT2
#define P2P_SPEC_NOA1_OFF_PERIOD    BIT3
#define P2P_CTWIN_EARLY_DISTX       BIT4
#define P2P_SPEC_BEACON_AREA_ON     BIT5
#define P2P_SPEC_CTW_ON             BIT6
#define P2P_SPEC_POWER_STATE        BIT7        // 1: on, 0: off


