Ameba-AIoT/ameba-arduino-d/Arduino_package/hardware/system/libameba/sdk/component/soc/realtek/amebad/wifi_fw/include/RTL8721D_Reg_ROM.h
//2 P2PPS_STATE 0x543
#define P2P_FORCE_DOZE0             BIT0
#define P2P_NOA0_OFF_PERIOD         BIT1
#define P2P_FORCE_DOZE1             BIT2
#define P2P_NOA1_OFF_PERIOD         BIT3
#define P2P_NOA_POWEROFF            BIT4
#define P2P_BEACON_AREA_ON          BIT5
#define P2P_CTW_ON                  BIT6
#define P2P_POWER_STATE             BIT7        // 1: on, 0: off


//2 BCN_CTRL
#define EN_MBSSID                   BIT1
#define EN_TXBCN_RPT                BIT2
#define EN_BCN_FUNCTION             BIT3

//2 DUAL_TSF_RST
#define TSFTR_RST                   BIT0
#define TSFTR1_RST                  BIT1


#define STOP_BCNQ                   BIT6

// The same function but different bit field.
#define DIS_TSF_UDT0_NORMAL_CHIP    BIT4
#define DIS_TSF_UDT0_TEST_CHIP      BIT5

//2 ACMHWCTRL
#define AcmHw_HwEn                  BIT0
#define AcmHw_BeqEn                 BIT1
#define AcmHw_ViqEn                 BIT2
#define AcmHw_VoqEn                 BIT3
#define AcmHw_BeqStatus             BIT4
#define AcmHw_ViqStatus             BIT5
#define AcmHw_VoqStatus             BIT6



//-----------------------------------------------------
//
//  0x0600h ~ 0x07FFh   WMAC Configuration
//
//-----------------------------------------------------

//2 APSD_CTRL
#define APSDOFF                     BIT6
#define APSDOFF_STATUS              BIT7


//2 BWOPMODE
#define BW_20MHZ                    BIT2
//#define BW_OPMODE_20MHZ               BIT2  // For compability


#define RATE_BITMAP_ALL             0xFFFFF

// Only use CCK 1M rate for ACK
#define RATE_RRSR_CCK_ONLY_1M       0xFFFF1

//2 TCR
#define TSFRST                      BIT0
#define DIS_GCLK                    BIT1
#define PAD_SEL                     BIT2
#define PWR_ST                      BIT6
#define PWRBIT_OW_EN                BIT7
#define ACRC                        BIT8
#define CFENDFORM                   BIT9
#define ICV                         BIT10



//2 RCR
#define AAP                         BIT0
#define APM                         BIT1
#define AM                          BIT2
#define AB                          BIT3
#define ADD3                        BIT4
#define APWRMGT                     BIT5
#define CBSSID                      BIT6
#define CBSSID_DATA                 BIT6
#define CBSSID_BCN                  BIT7
#define ACRC32                      BIT8
#define AICV                        BIT9
#define ADF                         BIT11
#define ACF                         BIT12
#define AMF                         BIT13
#define HTC_LOC_CTRL                BIT14
#define UC_DATA_EN                  BIT16
#define BM_DATA_EN                  BIT17
#define MFBEN                       BIT22
#define LSIGEN                      BIT23
#define EnMBID                      BIT24
#define APP_BASSN                   BIT27
#define APP_PHYSTS                  BIT28
#define APP_ICV                     BIT29
#define APP_MIC                     BIT30
#define APP_FCS                     BIT31

//2 RX_PKT_LIMIT

//2 RX_DLK_TIME

//2 MBIDCAMCFG

//2 WOW_CTRL 0x690
#define FORCE_WAKE_UP               BIT0
#define PATTERN_MATCH_EN            BIT1
#define MAGIC_PKT_EN                BIT2
#define UNICAST_EN                  BIT3
#define WOWHCI_EN                   BIT5

//2 AMPDU_MIN_SPACE
#define _MIN_SPACE(x)               ((x) & 0x7)
#define _SHORT_GI_PADDING(x)        (((x) & 0x1F) << 3)


//2 RXERR_RPT
#define RXERR_TYPE_OFDM_PPDU            0
#define RXERR_TYPE_OFDM_FALSE_ALARM     1
#define RXERR_TYPE_OFDM_MPDU_OK         2
#define RXERR_TYPE_OFDM_MPDU_FAIL       3
#define RXERR_TYPE_CCK_PPDU             4
#define RXERR_TYPE_CCK_FALSE_ALARM      5
#define RXERR_TYPE_CCK_MPDU_OK          6
#define RXERR_TYPE_CCK_MPDU_FAIL        7
#define RXERR_TYPE_HT_PPDU              8
#define RXERR_TYPE_HT_FALSE_ALARM       9
#define RXERR_TYPE_HT_MPDU_TOTAL        10
#define RXERR_TYPE_HT_MPDU_OK           11
#define RXERR_TYPE_HT_MPDU_FAIL         12
#define RXERR_TYPE_RX_FULL_DROP         15

#define RXERR_COUNTER_MASK              0xFFFFF
#define RXERR_RPT_RST                   BIT27
#define _RXERR_RPT_SEL(type)            ((u32)((type) << 28))


//2 SECCFG
#define SCR_TxUseDK                     BIT0            //Force Tx Use Default Key
#define SCR_RxUseDK                     BIT1            //Force Rx Use Default Key
#define SCR_TxEncEnable                 BIT2            //Enable Tx Encryption
#define SCR_RxDecEnable                 BIT3            //Enable Rx Decryption
#define SCR_SKByA2                      BIT4            //Search kEY BY A2
#define SCR_NoSKMC                      BIT5            //No Key Search Multicast
#define SCR_TXBCUSEDK                   BIT6            // Force Tx Broadcast packets Use Default Key
#define SCR_RXBCUSEDK                   BIT7            // Force Rx Broadcast packets Use Default Key


//1 BCN_PSR_RPT [31:0]: Beacon Parser Report Register
//0~10      AID0
//11~13     RSVD
#define PS_TIM                          BIT6      //14
#define PS_DTIM                         BIT7      //15
//16~23     DTIM period
//24~31     DTIM COUNT


//1NAN CTRL
#define NAN_ENTRY_SIZE  64
#define NAN_ENTRY_NUM   1

#define NAN_PSR_EN      BIT0
#define _NAN_ENTRY_SIZE(size)   ((u8)(((((size)>>5)-2)&0x7)<<1))
#define _NAN_ENTRY_NUM(num)     ((u8)(((num)&0x7)<<4))
#define NAN_ATTRI_ID0_VLD   BIT0
#define NAN_ATTRI_ID1_VLD   BIT1
#define NAN_ATTRI_ID2_VLD   BIT2
#define NAN_ATTRI_ID3_VLD   BIT3
#define NAN_ATTRI_ID4_VLD   BIT4
#define NAN_RXA2_FILTER_EN  BIT5

//1 CPU DOMAIN
//-----------------------------------------------------
//
//  0xFD00h ~ 0xFDFFh   8051 CPU Local REG
//
//-----------------------------------------------------

//3 REG_SYS_CTRL(0xFD00)
//0xFD00[0]: 8051 sw reset for fpga use
//0xFD00[1:2] : rsvd
//0xFD00[3]: write reg 00[4] to trigger int pkt
#define WAKEUP_BUS                      BIT4    //dw8051 wakeup usb2/3
//0xFD00[5] : rsvd
#define SYS_CTRL_TXBUF_ROM_ENABLE       BIT6    //enable this bit when 8051 want to run instruntion and disable while leaving.       
//0xFD00[7]: auto clr 0xFD20 ~ 0xFD3F reg

//3 REG_PONSTS_RPT1(0xFD01)
#define PONSTS1_FW_DATA_RDY             BIT0
#define PONSTS1_HCI_SEL                 BIT1    //usb/pcie hci sel(0:pcie, 1:usb)    
#define PONSTS1_USB2_SEL                BIT2    //usb2 card emulation to usb2
#define PONSTS1_EEPROM_LOAD_OK          BIT3    //reg0x0A[5]
#define PONSTS1_MCUFWDL_RDY             BIT4    //reg0x80[1]
#define PONSTS1_MCUFWDL_EN              BIT5    //reg0x80[0]
#define PONSTS1_USB_BUS_ACTIVE          BIT6    //usb suspend
#define PONSTS1_RAM_SPACE_SEL           BIT7

//3 REG_PONSTS_RPT2(0xFD02)
//0xFD02[7:4]       : ICFG              (0xF0[31:28])
//0xFD02[3:1]       : INI_RDY           (0x80[5:3])
//0xFD02[0]         : MCU_RSTST         (0x80[23])

//3 REG_PONSTS_RPT3(0xFD03)
//0xFD03[7]         : POR_CORE          (0x00[27])
//0xFD03[6]         : MACREG_EN         (0x00[31])
//0xFD03[5]         : PCLK_VLD          (0xF0[3])
//0xFD03[4]         : UCLK_VLD          (0xF0[2])
//0xFD03[3]         : ACLK_VLD          (0xF0[1])
//0xFD03[2]         : HCI_SEL           (0xF0[26])
//0xFD03[1]         : SIC_IDLE          (0xF0[8])
//0xFD03[0]         : MAC_RDY           (0x04[16])


/*------------------------------Define Enum-----------------------------------*/


/*--------------------------Define MACRO--------------------------------------*/

/*------------------------------Define Struct---------------------------------*/

/*------------------------Export global variable------------------------------*/

/*------------------------------Function declaration--------------------------*/


#endif  //__RTL8721D_REG_H__

